using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace Soft_Laba2
{
    internal class ConsoleIt
    {
            // Запуск консоли
        //----------------------------------------------------------------
        public void StartConsole()
        {
            // Запрос, сколко подарков будет для мужчин
            int countMan = GetCountMan();
            // Вызов метода, которая генерирует подарки для мужчин
            CreateGifts(countMan, "Мужчины");

            // Запрос, сколко подарков будет для женщин
            int countWoman = GetCountWoman();
            // Вызов метода, которая генерирует подарки для женщин
            CreateGifts(countWoman, "Женщины");

            // Вывод информации
            BoxGift.Info(); 
        }
        //----------------------------------------------------------------

            // Взаимодейсвие с пользователем
        //----------------------------------------------------------------
        // Запрос, кол-во мужчин в офисе
        private int GetCountMan()
        {
            Console.WriteLine("Сколько мужчин в офисе?:");
            int count = Convert.ToInt32(Console.ReadLine());
            return count;
        }

        // Запрос, кол-во женщин в офисе
        private int GetCountWoman()
        {
            Console.WriteLine("Сколько женщин в офисе?:");
            int count = Convert.ToInt32(Console.ReadLine());
            return count;
        }
        //----------------------------------------------------------------

            // Создание коробок с подарками
        //----------------------------------------------------------------
        private void CreateGifts(int count, string gender)
        {
            // Создание коробки по гендеру (Мужчина/Женищна)
            var boxGender = new Box(gender);

            // Генерация определённого кол-ва подарков
            //----------------------------------------------------------------
            for (int i = 0; i < count; i++)
            {
                // Запрос, узнаем для кого будет подарок(Имя)
                //----------------------------------------------------------------
                Console.WriteLine("Для кого подарок?:");
                string name = Console.ReadLine();
                //----------------------------------------------------------------

                // Запрос, узнаем сколько будет подарков
                //----------------------------------------------------------------
                Console.WriteLine($"Сколько подарков для {name}?:");
                int countGift = Convert.ToInt32(Console.ReadLine());
                //----------------------------------------------------------------

                // Создание коробки для определёного человека
                var boxForPerson = new Box(name);

                // Генерация подарков
                //----------------------------------------------------------------
                for (int j = 0; j < countGift; j++)
                {
                    // Запрос, узнает какой подарок положить в коробку
                    //----------------------------------------------------------------
                    Console.WriteLine($"Какой подарок вы подарите {name}?:");
                    string nameGift = Console.ReadLine();
                    //----------------------------------------------------------------

                    // Добавление подарка в коробку
                    boxForPerson.Append(new Gift(nameGift));
                }
                //----------------------------------------------------------------

                // Добавление в коробку по гендеру, коробку с подарками определенного человека
                boxGender.Append(boxForPerson);
            }
            //----------------------------------------------------------------

            // Добавление в общую коробку, коробку для определенного пола
            BoxGift.Append(boxGender);
        }
        //----------------------------------------------------------------

            // Переменные
        //----------------------------------------------------------------
        // Создание общей коробки с подарками
        private Box BoxGift  = new Box("Коробка с подарками");
        //----------------------------------------------------------------
    }
}
